In [1]:
import seaborn as sns

In [18]:
data  = sns.load_dataset('titanic')

In [19]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
data.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [21]:
# Delete The Rows or data 
data.dropna().shape

(182, 15)

In [22]:
# Delete Columns 
data.dropna(axis=1)

,survived,pclass,sex,sibsp,parch,fare,class,who,adult_male,alive,alone
0,0,3,male,1,0,7.2500,Third,man,True,no,False
1,1,1,female,1,0,71.2833,First,woman,False,yes,False
2,1,3,female,0,0,7.9250,Third,woman,False,yes,True
3,1,1,female,1,0,53.1000,First,woman,False,yes,False
4,0,3,male,0,0,8.0500,Third,man,True,no,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Second,man,True,no,True
887,1,1,female,0,0,30.0000,First,woman,False,yes,True
888,0,3,female,1,2,23.4500,Third,woman,False,no,False
889,1,1,male,0,0,30.0000,First,man,True,yes,True
890,0,3,male,0,0,7.7500,Third,man,True,no,True

In [23]:
# Imputation Technique
# 1 -  Mean Imputation Technique -> It works good when the data is Normally distributed 
data['age_mean'] = data['age'].fillna(data['age'].mean())

In [24]:
#2.Median -> If we have the Outliers we Use this One
data['age_median'] = data['age'].fillna(data['age'].median())

In [28]:
# 3. Mode Imputation -> Categorical Values
data['embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [35]:
# To find the Mode value
mode_value  = data[data['embarked'].notna()]['embarked'].mode()[0]

In [36]:
mode_value

'S'

In [37]:
data['embarked_mode'] = data['embarked'].fillna(mode_value)

In [38]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,age_median,embarked_mode
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22.0,22.0,S
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38.0,38.0,C
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26.0,26.0,S
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35.0,35.0,S
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35.0,35.0,S

### Handling Imbalanced Data
1. Up Scaling
2. Down Scaling

In [39]:
import numpy as np

In [40]:
np.random.seed(123)
n_samples = 1000
class_0_ratio  = 0.9
n_class_0 = int(n_samples * class_0_ratio)
n_class_1 = n_samples - n_class_0

In [41]:
n_class_0,n_class_1

(900, 100)

In [42]:
# Create a DataFrame
import pandas as pd
class_0 = pd.DataFrame({
    'feature_1': np.random.normal(loc=0, scale=1, size=n_class_0),
    'feature_2': np.random.normal(loc=0, scale=1, size=n_class_0),
    'target': [0]*n_class_0
})
class_1 =  pd.DataFrame({
'feature_1': np.random.normal(loc=2, scale=1, size=n_class_1),
'feature_2': np.random.normal(loc=2, scale=1, size=n_class_1),
'target': [1]*n_class_1
})

In [45]:
df = pd.concat([class_0,class_1]).reset_index(drop=True)

In [46]:
df.head()

   feature_1  feature_2  target
0  -1.085631   0.551302       0
1   0.997345   0.419589       0
2   0.282978   1.815652       0
3  -1.506295  -0.252750       0
4  -0.578600  -0.292004       0

In [47]:
df['target'].value_counts()

target
0    900
1    100
Name: count, dtype: int64

In [48]:
#Upsampling
df_minority=df[df['target'] == 1]
df_majority=df[df['target'] == 0]

In [50]:
from sklearn.utils import resample
df_minority_upsampled=resample(df_minority,replace=True,n_samples=len(df_majority),random_state=42)

In [57]:
df_upsampled = pd.concat([df_majority,df_minority_upsampled])

In [58]:
df_upsampled.value_counts()

feature_1  feature_2  target
 1.005190   1.110089  1         19
 1.915470   1.652041  1         18
 3.701608   2.160889  1         18
 3.013493   2.047240  1         16
 2.902006   0.390305  1         16
                                ..
-1.305786  -0.366811  0          1
-1.297100  -1.270276  0          1
-1.294085  -0.692923  0          1
-1.273570   1.752910  0          1
-1.942150  -1.140534  0          1
Name: count, Length: 1000, dtype: int64